// 1)Цикли допомагають виповнити  один і той же кусок коду багато разів

// 2) while - використовується коли не відомо скільки разів буде виконуватись код
// for - якщо є розуміння скільки разів потрібно виконати код
// do while - якщо необхідно спочатку виконати дію, а потім перевырку, в такому випадку код обов'язково виконається мінімум 1 раз
// switch - використовуэться в тому випадку, коли ми знаємо які числа буде вводити користувач.


// 3) неявне перетворення типів виникає в процесі роботи якихось операторів, виникає само без наших дій.
//     const name;
//     name = 1 + "true";    //'1true'
//     name = 1 + true;       //2
//     name = 1 + undefined; //NaN
//     name = 1 + null;     //1

// явне перетворення типів ми запускаємо своїми діями за допомогою функцій Boolean(), Number(), String()
//     const number;
//     alert( Number('8') / Number('2') ); // 4

// ЗАВДАННЯ

"use strict";
const userNumber = +prompt("Введите Ваше число");
switch (userNumber) {
    case  1:
    case  2:
    case  3:
    case  4:
        alert("Sorry, no numbers");
        break;
    default:
        break;
}

for (let i = 0; i <= userNumber; i++) {
    if (userNumber >= i && i % 5 === 0) {
        console.log(i);
    }
}
